simonnkm/Ambiance/Ambiance-main/WPSSource/WildlifeSource/STM32_BLE/App/app_ble.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    app_ble.c
  * @author  GPM WBL Application Team
  * @brief   BLE Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include "main.h"
#include "stm32wb0x.h"
#include "ble.h"
#include "gatt_profile.h"
#include "gap_profile.h"
#include "app_ble.h"
#include "stm32wb0x_hal_radio_timer.h"
#include "bleplat.h"
#include "nvm_db.h"
#include "blenvm.h"
#include "pka_manager.h"
#include "stm32_seq.h"
#include "usart.h"
#include "usart_app.h"
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/**
 * Security parameters structure
 */
typedef struct
{
  /**
   * IO capability of the device
   */
  uint8_t ioCapability;

  /**
   * Authentication requirement of the device
   * Man In the Middle protection required?
   */
  uint8_t mitm_mode;

  /**
   * bonding mode of the device
   */
  uint8_t bonding_mode;

  /**
   * minimum encryption key size requirement
   */
  uint8_t encryptionKeySizeMin;

  /**
   * maximum encryption key size requirement
   */
  uint8_t encryptionKeySizeMax;

  /**
   * this flag indicates whether the host has to initiate
   * the security, wait for pairing or does not have any security
   * requirements.
   * 0x00 : no security required
   * 0x01 : host should initiate security by sending the security
   *        request command
   * 0x02 : host need not send the clave security request but it
   * has to wait for paiirng to complete before doing any other
   * processing
   */
  uint8_t initiateSecurity;
  /* USER CODE BEGIN tSecurityParams*/

  /* USER CODE END tSecurityParams */
}SecurityParams_t;

/**
 * Global context contains all BLE common variables.
 */
typedef struct
{
  /**
   * security requirements of the host
   */
  SecurityParams_t bleSecurityParam;

  /**
   * gap service handle
   */
  uint16_t gapServiceHandle;

  /**
   * device name characteristic handle
   */
  uint16_t devNameCharHandle;

  /**
   * appearance characteristic handle
   */
  uint16_t appearanceCharHandle;

  /**
   * connection handle of the current active connection
   * When not in connection, the handle is set to 0xFFFF
   */
  uint16_t connectionHandle;
  /* USER CODE BEGIN BleGlobalContext_t*/

  /* USER CODE END BleGlobalContext_t */
}BleGlobalContext_t;

typedef struct
{
  BleGlobalContext_t BleApplicationContext_legacy;
  APP_BLE_ConnStatus_t Device_Connection_Status;
  /* USER CODE BEGIN PTD_1*/

  /* USER CODE END PTD_1 */
}BleApplicationContext_t;

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */
/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */
/* Private variables ---------------------------------------------------------*/

NO_INIT(uint32_t dyn_alloc_a[BLE_DYN_ALLOC_SIZE>>2]);

static BleApplicationContext_t bleAppContext;

USART_APP_ConnHandleNotEvt_t USARTHandleNotification;

/* Device name is now built at runtime as "Ambiance Speaker XXXX", where XXXX
 * is a 4-hex-digit tag derived from this chip's factory-programmed 64-bit
 * unique ID (see BLE_BuildDeviceName()). Every unit previously advertised
 * the same fixed name AND the same fixed BD address (CFG_PUBLIC_BD_ADDRESS in
 * app_conf.h), so BLE scanners deduplicated multiple nearby speakers into a
 * single entry. The address fix (switch to HCI_ADDR_STATIC_RANDOM_ADDR) makes
 * each unit discoverable as a distinct device; this name suffix makes them
 * distinguishable at a glance in the GUI's device list too. */
#define GAP_DEVICE_NAME_PREFIX   "Ambiance Speaker "
#define GAP_DEVICE_NAME_ID_LEN   4U   /* hex chars appended from the unique chip ID */
#define GAP_DEVICE_NAME_LEN      (sizeof(GAP_DEVICE_NAME_PREFIX) - 1U + GAP_DEVICE_NAME_ID_LEN)

static uint8_t a_GapDeviceName[GAP_DEVICE_NAME_LEN]; /* Gap Device Name, filled in by BLE_BuildDeviceName() */

/**
 * Advertising Data
 */
uint8_t a_AdvData[3U + 2U + GAP_DEVICE_NAME_LEN] =
{
  2, AD_TYPE_FLAGS, FLAG_BIT_LE_GENERAL_DISCOVERABLE_MODE|FLAG_BIT_BR_EDR_NOT_SUPPORTED,
  1 + GAP_DEVICE_NAME_LEN, AD_TYPE_COMPLETE_LOCAL_NAME,  /* name bytes filled in by BLE_BuildDeviceName() */
};

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void connection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Peer_Address_Type,
                                      uint8_t Peer_Address[6],
                                      uint16_t Connection_Interval,
                                      uint16_t Peripheral_Latency,
                                      uint16_t Supervision_Timeout);

static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private functions ---------------------------------------------------------*/

/* USER CODE BEGIN PF */

/* USER CODE END PF */

/* Functions Definition ------------------------------------------------------*/
void ModulesInit(void)
{
  BLENVM_Init();
  if (PKAMGR_Init() == PKAMGR_ERROR)
  {
    Error_Handler();
  }
}

/**
 * Build a per-unit device name ("Ambiance Speaker XXXX") from the chip's
 * factory-programmed 64-bit unique ID (UID64_BASE), and copy it into both
 * the GAP device name characteristic buffer and the advertising data buffer.
 * Must run before Gap_profile_set_dev_name() and before advertising starts.
 */
static void BLE_BuildDeviceName(void)
{
  static const char hex_digits[] = "0123456789ABCDEF";
  const uint32_t uid0 = *(volatile uint32_t *)(UID64_BASE);
  const uint32_t uid1 = *(volatile uint32_t *)(UID64_BASE + 4U);
  /* Fold the 64-bit factory UID down to a 16-bit tag - unique enough to
   * tell nearby units apart in a scan list without needing the full ID. */
  const uint16_t id_tag = (uint16_t)(((uid0 * 2654435761U) ^ (uid1 * 2246822519U)) >> 16);
  const size_t prefix_len = sizeof(GAP_DEVICE_NAME_PREFIX) - 1U;

  memcpy(a_GapDeviceName, GAP_DEVICE_NAME_PREFIX, prefix_len);
  a_GapDeviceName[prefix_len + 0U] = (uint8_t)hex_digits[(id_tag >> 12) & 0xFU];
  a_GapDeviceName[prefix_len + 1U] = (uint8_t)hex_digits[(id_tag >> 8)  & 0xFU];
  a_GapDeviceName[prefix_len + 2U] = (uint8_t)hex_digits[(id_tag >> 4)  & 0xFU];
  a_GapDeviceName[prefix_len + 3U] = (uint8_t)hex_digits[id_tag & 0xFU];

